[
    {
        "id": "1",
        "naslov": "House",
        "tekst": "House is a genre of electronic dance music characterized by a repetitive four-on-the-floor beat and a tempo of 120 to 130 beats per minute. It was created by DJs and music producers from Chicago's underground club culture in the 1980s, as DJs from the subculture began altering disco songs to give them a more mechanical beat and deeper basslines. The genre was pioneered by DJs and producers mainly from Chicago and New York such as Frankie Knuckles, Larry Levan, Ron Hardy, Jesse Saunders, Chip E., Steve ‘Silk’ Hurley, Mr. Lee, Farley ‘Jackmaster’ Funk, Marshall Jefferson, Phuture and others. From its beginnings in the Chicago club and local radio scene, the genre expanded internationally to London, then to other American cities such as New York City and Detroit before becoming a worldwide phenomenon. House has had a large impact on pop music, especially dance music. It was incorporated by major pop artists including Janet Jackson, Madonna and Kylie Minogue, but also produced some mainstream hits on its own, such as ‘French Kiss’ by Lil Louis (1989), ‘Show Me Love’ by Robin S. (1992) or ‘Push the Feeling On’ by Nightcrawlers (1992/1995). Many house producers also did and continue to do remixes for pop artists. Until today, house music has remained popular on radio and in clubs while retaining a foothold on the underground scenes across the globe."
    },
    {
        "id": "2",
        "naslov": "Deep House",
        "tekst": "Deep house is a subgenre of house music  that originated in the 1980s, initially fusing elements of Chicago house with 1980s jazz-funk and touches of soul music. Its origins are attributed to Larry Heard's track ‘Mystery of Love’ in 1984. Deep house is known for tempos typically from 110 to 125 BPM, muted basslines, spacious use of percussion elements (typically using a Roland TR-909 drum machine), soft keyboard sounds (pads), use of advanced chord structures, ambient mixes, and soulful, predominantly female vocals. Lyrics usually focus on positive/uplifting or forlorn modern blues lyrics. The use of vocals persisted in deep house as new forms of house music often abandoned them, but as of 2019, this difference has largely disappeared. Influences of jazz music can be found in the use of more complex chords than simple triads -7ths, 9ths, 13ths, suspensions, alterations- and less mainstream chord progressions, giving compositions a slightly dissonant yet pleasant feel. Standard drops and buildups found in mainstream EDM are atypical in deep house."
    },
    {
        "id": "3",
        "naslov": "Progressive House",
        "tekst": "In disco music, and later house music, a similar desire to separate more exploratory styles from standard approaches saw DJs and producers adopting the word 'progressive' to make a distinction. According to the DJ and producer Carl Craig, the term 'progressive' was used in Detroit in the early 1980s in reference to Italo disco. The music was dubbed 'progressive' because it drew upon the influence of Giorgio Moroder's Euro disco rather than the disco inspired by the symphonic sound of Philadelphia soul. In Detroit, prior to the emergence of techno, artists like Alexander Robotnick, Klein + M.B.O. and Capricorn filled a vacancy left after disco's demise in America. In the late 1980s, UK music journalist Simon Reynolds introduced the term 'progressive dance' to describe acts such as 808 State, The Orb, Bomb the Bass and The Shamen. Between 1990 and 1992, the term 'progressive' referred to the short-form buzz word for the house music subgenre 'progressive house'."
    },
    {
        "id": "4",
        "naslov": "Drum and Bass",
        "tekst": "Drum and bass (also written as Drum&Bass or drum'n'bass and commonly abbreviated as D&B, DnB, or D'n'B) is a genre of electronic music characterised by fast breakbeats (typically 165-185 beats per minute) with heavy bass and sub-bass lines, samples, and synthesizers. The genre grew out of the UK's jungle scene in the early 1990s. The popularity of drum and bass at its commercial peak ran parallel to several other homegrown dance styles. A major influence was the original Jamaican dub and reggae sound that influenced jungle's bass-heavy sound. Another feature of the style is the complex syncopation of the drum tracks' breakbeat. Drum and bass subgenres include breakcore, ragga jungle, hardstep, darkstep, techstep, neurofunk, ambient drum and bass, liquid funk (a.k.a. liquid drum and bass), jump up, drumfunk, funkstep, sambass, and drill 'n' bass. Drum and bass has influenced many other genres like hip hop, big beat, dubstep, house, trip hop, ambient music, techno, jazz, rock and pop.Drum and bass is dominated by a relatively small group of record labels. Major international music labels had shown very little interest in the drum and bass scene until BMG Rights Management acquired RAM in February 2016. Since then, the genre has seen a significant growth in exposure. The origin and home of drum and bass music is in the UK, with other prominent fanbases located in Australia, Canada, New Zealand, United States, and South Africa. There's also a modest following in countries like Austria, Russia, Estonia, Czech Republic, the Netherlands, and more."
    }
]